# Получить грамматику G0

from myParser import Parser

p = Parser()
Bufer = p.INView('G0.xml')

# Получить внутренне представление грамматики G0

from grammairs import Grammair, deleteUseless, deleteAllLeftRecursion, fillGrammair

g = Bufer['Grammair']

# Печать Грамматики до манипуляций

print('-----------------------------------------------------------------------')
print(g)
print('-----------------------------------------------------------------------')

# Удаление бесполезных символов

print('Удалить бесполезные символы')

deleteUseless(g)

print('-----------------------------------------------------------------------')
print(g)
print('-----------------------------------------------------------------------')

# Удаление левой рекурсии

print('Удалить произвольную левую рекурсию')

deleteAllLeftRecursion(g)

print('-----------------------------------------------------------------------')
print(g)
print('-----------------------------------------------------------------------')


print('=======================================================================')
print('=======================================================================')
print('Еще примеры')
print('-----------------------------------------------------------------------')
print('Удаление бесполезных символов')

pg = Grammair()

t = 's,a,f'.split(',')
n = 'A,B,S,E,F'.split(',')
s = 'S'
r = [
    [['S'], ['A', 'S']],
    [['S'], ['s']],
    [['E'], ['E', 'F']],
    [['E'], ['F', 'F']],
    [['A'], ['a']],
    [['F'], ['f']],
]

fillGrammair(pg, t, n, s, r)

print('-----------------------------------------------------------------------')
print(pg)
print('-----------------------------------------------------------------------')
deleteUseless(pg)
print('-----------------------------------------------------------------------')
print(pg)
print('-----------------------------------------------------------------------')


